OpenFOAM-3.01/tutorials/nozzleFlow2D/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 3.7e6;
//internalField   uniform 2.94E+007;

boundaryField
{
    axis
    {
        type            empty;
    }
    inlet
    {
        type            fixedValue;
        value           uniform 3.7e6;
//        value           uniform 2.94E+007;
    }

    walls
    {
        type            zeroGradient;
    }

    exterior
    {
        type            zeroGradient;
    }
    atmosphere
    {
        type            zeroGradient;
    }
    front
    {
        type            wedge;
    }
    back
    {
        type            wedge;
    }

}


// ************************************************************************* //
